# Network Engineer. Basic. ДЗ №12 по лекции №28.

## Лабораторная работа. Настройка NAT для IPv4

![](https://github.com/yksie/Network-engineer/blob/main/lab12(lec28-29)_NAT/Screenshot_1.jpg)

## Задание

##### Часть 1. Создание сети и настройка основных параметров устройств

##### Часть 2. Настройка и проверка NAT для IPv4

##### Часть 3. Настройка и проверка PAT для IPv4

##### Часть 4. Настройка и проверка статического NAT для IPv4.

___

### Часть 1. Создание сети и настройка основных параметров устройств

![](https://github.com/yksie/Network-engineer/blob/main/lab12(lec28-29)_NAT/Screenshot_2.jpg)

Произведено создание сети и настройка основных параметров устройств, настройка сетей VLAN1 на коммутаторах

**Произведите базовую настройку маршрутизаторов**

en  
conf t  
enable secret class  
service password-encryption   
line console 0  
password cisco  
login  
logging synchronous   
exit  
line vty 0 15  
password cisco  
login  
exit  
banner motd #  
GO AWAY!!!#  
ex  
copy run start  
conf t  
int g 0/0/0  
ip addr 192.168.1.1 255.255.255.0  
int g 0/0/1  
ip addr 209.165.200.230 255.255.255.248  

R1(config) # ip route 209.165.200.0 255.255.255.224 GigabitEthernet0/0/0  
R2(config) # ip route 192.168.1.0 255.255.255.0 GigabitEthernet0/0/0  

ex  
copy run start  

**Настройте базовые параметры каждого коммутатора.**

en  
conf t  
no ip domain-lookup  
enable secret class  
service password-encryption   
line console 0  
password cisco  
login  
logging synchronous   
exit  
line vty 0 15  
password cisco  
login  
exit  
banner motd #  
GO AWAY!!!#  
ex  
copy run start  
conf t  
int vlan 1  
ip addr 192.168.1.11 255.255.255.0  
no shut  
ex  
ex  
copy run start  

### Часть 2. Настройка и проверка NAT для IPv4

#### Настройте NAT на R1, используя пул из трех адресов 209.165.200.226-209.165.200.228. 

Настройте простой список доступа, который определяет, какие хосты будут разрешены для трансляции. В этом случае все устройства в локальной сети R1 имеют право на трансляцию.  
R1(config)# **access-list 1 permit 192.168.1.0 0.0.0.255**  
Создайте пул NAT и укажите ему имя и диапазон используемых адресов.  
R1(config)# **ip nat pool PUBLIC_ACCESS 209.165.200.226 209.165.200.228 netmask 255.255.255.248**  
Примечание. Параметр маски сети не является разделителем IP-адресов. Это должна быть правильная маска подсети для назначенных адресов, даже если вы используете не все адреса подсети в пуле.  
Настройте перевод, связывая ACL и пул с процессом преобразования.  
R1(config)# **ip nat inside source list 1 pool PUBLIC_ACCESS**  
Примечание: Три очень важных момента. Во-первых, слово «inside» имеет решающее значение для работы такого рода NAT. Если вы опустить его, NAT не будет работать. Во-вторых, номер списка — это номер ACL, настроенный на предыдущем шаге. В-третьих, имя пула чувствительно к регистру.  
Задайте внутренний (inside) интерфейс.  
R1(config)# **interface g0/0/1**  
R1(config-if)# **ip nat inside**  
Определите внешний (outside) интерфейс.  
R1(config)# **interface g0/0/0**  
R1(config-if)# **ip nat outside**  

![](https://github.com/yksie/Network-engineer/blob/main/lab12(lec28-29)_NAT/Screenshot_3.jpg)

#### Проверьте и проверьте конфигурацию.  
С PC-B,  запустите эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. Если эхо-запрос не прошел, выполните процес поиска и устранения неполадок. На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations.  
R1# show ip nat translations  

![](https://github.com/yksie/Network-engineer/blob/main/lab12(lec28-29)_NAT/Screenshot_4.jpg)  

Вопросы:  
Во что был транслирован внутренний локальный адрес PC-B?  
__в 209.165.200.226:130 (131, 132, 133)__
Какой тип адреса NAT является переведенным адресом?
 __Inside Global__


С PC-A, запустите  эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. Если эхо-запрос не прошел, выполните отладку. На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations.  
R1# **show ip nat translations**   

![](https://github.com/yksie/Network-engineer/blob/main/lab12(lec28-29)_NAT/Screenshot_5.jpg)  

Обратите внимание, что предыдущая трансляция для PC-B все еще находится в таблице. Из S1, эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. Если эхо-запрос не прошел, выполните отладку. На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations.
R1# **show ip nat translations**

![](https://github.com/yksie/Network-engineer/blob/main/lab12(lec28-29)_NAT/Screenshot_6.jpg)

**В cpt записи в R1 быстро пропадают**  
При одновременном пинге Lo1(R2) с трёх устройств:  

![](https://github.com/yksie/Network-engineer/blob/main/lab12(lec28-29)_NAT/Screenshot_7.jpg)

Теперь запускаем пинг R2 Lo1 из S2. На этот раз перевод завершается неудачей, и вы получаете эти сообщения (или аналогичные) на консоли R1:
Sep 23 15:43:55.562: %IOSXE-6-PLATFORM: R0/0: cpp_cp: QFP:0.0 Thread:000 TS:00000001473688385900 %NAT-6-ADDR_ALLOC_FAILURE: Address allocation failed; pool 1 may be exhausted [2]

__ping неуспешен от S2 до R2 Lo1, но сообщение на R1 не получено__


Учитывая, что пул ограничен тремя адресами, NAT для пула адресов недостаточно для нашего приложения. Очистите преобразование NAT и статистику, и мы перейдем к PAT.  
R1# clear ip nat translations *  
R1# **clear ip nat statistics – этой команды нет в cpt**  



### Часть 3. Настройка и проверка PAT для IPv4

#### Удалите команду преобразования на R1.
Откройте окно конфигурации  
Компоненты конфигурации преобразования адресов в основном одинаковы; что-то (список доступа) для идентификации адресов, пригодных для перевода, дополнительно настроенный пул адресов для их преобразования и команды, необходимые для идентификации внутреннего и внешнего интерфейсов. Из части 1 наш список доступа (список доступа 1) по-прежнему корректен для сетевого сценария, поэтому нет необходимости воссоздавать его. Мы будем использовать один и тот же пул адресов, поэтому нет необходимости воссоздавать эту конфигурацию. Кроме того, внутренний и внешний интерфейсы не меняются. Чтобы начать работу в части 3, удалите команду, связывающую ACL и пул вместе.  
R1(config)# **no ip nat inside source list 1 pool PUBLIC_ACCESS**  
#### Добавьте команду PAT на R1.  
Теперь настройте преобразование PAT в пул адресов (помните, что ACL и Pool уже настроены, так что это единственная команда, которую нам нужно изменить с NAT на PAT).
R1(config)# **ip nat inside source list 1 pool PUBLIC_ACCESS overload**  
#### Протестируйте и проверьте конфигурацию.  
a.	Давайте проверим, что PAT работает. С PC-B,  запустите эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. Если эхо-запрос не прошел, выполните отладку. На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations.  
R1# **show ip nat translations**  

![](https://github.com/yksie/Network-engineer/blob/main/lab12(lec28-29)_NAT/Screenshot_8.jpg)

Вопросы:  
Во что был транслирован внутренний локальный адрес PC-B?  
 __209.165.200.227:150 (151,152,153)__  
Какой тип адреса NAT является переведенным адресом?  
 __inside global__  
 
С PC-A, запустите эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. Если эхо-запрос не прошел, выполните отладку. На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations.  

Генерирует трафик с нескольких устройств для наблюдения PAT. На PC-A и PC-B используйте параметр -t с командой ping, чтобы отправить безостановочный ping на интерфейс Lo1 R2 (ping -t 209.165.200.1), затем вернитесь к R1 и выполните команду show ip nat translations:


![](https://github.com/yksie/Network-engineer/blob/main/lab12(lec28-29)_NAT/Screenshot_9.jpg)

Внутренний глобальный адрес одинаков для обоих сеансов. 

Вопрос:
Как маршрутизатор отслеживает, куда идут ответы? 
__по порту__
 
PAT в пул является очень эффективным решением для малых и средних организаций. Тем не менее есть неиспользуемые адреса IPv4, задействованные в этом сценарии. Мы перейдем к PAT с перегрузкой интерфейса, чтобы устранить эту трату IPv4 адресов. Остановите ping на PC-A и PC-B с помощью комбинации клавиш Control-C, затем очистите трансляции и статистику:  
R1# clear ip nat translations *  
R1# clear ip nat statistics (не реализовано в CPT)  
#### На R1 удалите команды преобразования nat pool.  
Опять же, наш список доступа (список доступа 1) по-прежнему корректен для сетевого сценария, поэтому нет необходимости воссоздавать его. Кроме того, внутренний и внешний интерфейсы не меняются. Чтобы начать работу с PAT к интерфейсу, очистите конфигурацию, удалив пул NAT и команду, связывающую ACL и пул вместе.  
R1(config)# **no ip nat inside source list 1 pool PUBLIC_ACCESS overload**  
R1(config)# **no ip nat pool PUBLIC_ACCESS**  
#### Добавьте команду PAT overload, указав внешний интерфейс.  
Добавьте команду PAT, которая вызовет перегрузку внешнего интерфейса.  
R1(config)# **ip nat inside source list 1 interface g0/0/0 overload**   
#### Протестируйте и проверьте конфигурацию.  
Давайте проверим PAT, чтобы интерфейс работал. С PC-B,  запустите эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. Если эхо-запрос не прошел, выполните отладку. На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations.  

Сделайте трафик с нескольких устройств для наблюдения PAT. На PC-A и PC-B используйте параметр -t с командой ping для отправки безостановочного ping на интерфейс Lo1 R2 (ping -t 209.165.200.1). На S1 и S2 выполните привилегированную команду exec ping 209.165.200.1 повторить 2000. Затем вернитесь к R1 и выполните команду show ip nat translations.   
  
![](https://github.com/yksie/Network-engineer/blob/main/lab12(lec28-29)_NAT/Screenshot_10.jpg)  

### Часть 4. Настройка и проверка статического NAT для IPv4.  

В части 4 будет настроена статическая NAT таким образом, чтобы PC-A был доступен напрямую из Интернета. PC-A будет доступен из R2 по адресу 209.165.200.229.
Примечание. Конфигурация, которую вы собираетесь завершить, не соответствует рекомендуемым практикам для шлюзов, подключенных к Интернету. Эта лаборатория полностью опускает стандартные методы безопасности, чтобы сосредоточиться на успешной конфигурации статического NAT. В производственной среде решающее значение для удовлетворения этого требования будет иметь тщательная координация между сетевой инфраструктурой и группами безопасности.  
#### На R1 очистите текущие трансляции и статистику.
Откройте окно конфигурации  
R1# clear ip nat translations *  
R1# clear ip nat statistics   
#### На R1 настройте команду NAT, необходимую для статического сопоставления внутреннего адреса с внешним адресом.  
Для этого шага настройте статическое сопоставление между 192.168.1.11 и 209.165.200.1 с помощью следующей команды:  
R1(config)# **ip nat inside source static 192.168.1.2 209.165.200.229**  
#### Протестируйте и проверьте конфигурацию.  
Давайте проверим, что статический NAT работает. На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations, и вы увидите статическое сопоставление. 

![](https://github.com/yksie/Network-engineer/blob/main/lab12(lec28-29)_NAT/Screenshot_11.jpg)

Таблица перевода показывает, что статическое преобразование действует. Проверьте это, запустив ping  с R2 на 209.165.200.229. Плинги должны работать.

![](https://github.com/yksie/Network-engineer/blob/main/lab12(lec28-29)_NAT/Screenshot_12.jpg)

На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations, и вы увидите статическое сопоставление и преобразование на уровне порта для входящих pings.  

![](https://github.com/yksie/Network-engineer/blob/main/lab12(lec28-29)_NAT/Screenshot_13.jpg)



